# アプリケーションインストール先の指定
cask_args appdir: "/Applications"

# アプリケーションをインストールする元リポジトリの指定
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "heroku/brew"

# caskで入れるのはデスクトップアプリケーション
cask "google-chrome"
cask "visual-studio-code"
cask "zoom"
cask "alfred"
cask "postman"
cask "drawio"
cask "firefox"
cask "docker"
cask "warp"

# brewで入れるのはCLIアプリケーション
brew "asdf"
brew "docker"
brew "jq"
brew "ag"
brew "jump"
brew "mas"
brew "fzf"
brew "tree"
brew "bat"
brew "gpg"
brew "awscli"
brew "git"
brew "git-lfs"
brew "v8@3.15"
brew "yarn"
brew "hstr"

# masで入れるのはMac App Store上のアプリケーション
mas "Xcode", id: 497799835
mas "Display Menu", id: 549083868
mas "RunCat", id: 1429033973
mas "Magnet マグネット", id: 441258766
mas "Spark - メールアプリ by Readdle", id: 1176895641
mas "ZIPANG", id: 882655968
