cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "heroku/brew"

cask "google-chrome"
cask "box-drive"
cask "emacs"
cask "visual-studio-code"
cask "microsoft-office"
cask "microsoft-teams"
cask "zoom"
cask "alfred"
cask "typora"
cask "postman"
cask "drawio"
cask "font-jetbrains-mono"
cask "choosy"
cask "firefox"

cask "docker"
brew "docker"

brew "asdf"
brew "tmux"
brew "jq"
brew "ag"
brew "jump"
brew "pure"
brew "mas"
brew "fzf"
brew "tree"
brew "bat"
brew "gpg"
brew "zplug"
brew "heroku"
brew "awscli"
brew "git"
brew "git-lfs"
brew "mysql-connector-c"
brew "shared-mime-info"
brew "yarn"
brew "hstr"

mas "CyberDuck", id: 409222199
mas "Xcode ", id: 497799835
mas "feedly. Read more, know more.", id: 865500966